app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["title", "asdf"], ["description", "add"], ["created_at", "2018-10-04 17:17:41.031733"], ["updated_at", "2018-10-04 17:17:41.031733"], ["image", "Screen_Shot_2018-09-19_at_9.27.45_AM.png"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "image" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image", "Screen_Shot_2018-09-19_at_9.27.45_AM.png"], ["updated_at", "2018-10-04 17:40:57.530483"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)